In [1]:
import pandas as pd 
import numpy as np

In [8]:
example = pd.read_csv('example.csv')

In [15]:
example.to_csv("example_gggg.csv")

In [9]:
example

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
Excel_Sample = pd.read_excel("Excel_Sample.xlsx")

In [14]:
Excel_Sample.to_excel("Excel_Sample_up.xlsx")

In [12]:
Excel_Sample

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [64]:
df_1 = pd.DataFrame({'col1':[1,2,3,4,5],"col2":[444,555,666,444,555],"col3":['abc','dff','rt','ii','fg']})

In [42]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  dff
2     3   666   rt
3     4   444   ii
4     5   555   fg

In [43]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [44]:
df['col2'].nunique()

3

In [45]:
df['col2'].value_counts()

444    2
555    2
666    1
Name: col2, dtype: int64

In [46]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  dff
2     3   666   rt
3     4   444   ii
4     5   555   fg

In [49]:
df[(df['col1']>=1) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
3     4   444   ii

In [50]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [51]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [54]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [56]:
df = pd.DataFrame({'col1':[np.nan,2,3,4,5],"col2":[444,np.nan,666,444,555],"col3":['abc','dff','rt','ii','fg']})

In [57]:
df

   col1   col2 col3
0   NaN  444.0  abc
1   2.0    NaN  dff
2   3.0  666.0   rt
3   4.0  444.0   ii
4   5.0  555.0   fg

In [61]:
df.isnull()

    col1   col2   col3
0   True  False  False
1  False   True  False
2  False  False  False
3  False  False  False
4  False  False  False

In [60]:
df.fillna('ana_m4_fady')

          col1         col2 col3
0  ana_m4_fady        444.0  abc
1          2.0  ana_m4_fady  dff
2          3.0        666.0   rt
3          4.0        444.0   ii
4          5.0        555.0   fg

In [63]:
df

   col1   col2 col3
0   NaN  444.0  abc
1   2.0    NaN  dff
2   3.0  666.0   rt
3   4.0  444.0   ii
4   5.0  555.0   fg

In [62]:
df.dropna()

   col1   col2 col3
2   3.0  666.0   rt
3   4.0  444.0   ii
4   5.0  555.0   fg

In [65]:
df_1

   col1  col2 col3
0     1   444  abc
1     2   555  dff
2     3   666   rt
3     4   444   ii
4     5   555   fg

In [66]:
df_1.mean()
(444+555+666+444+555)/5

C:\Users\AMIT\AppData\Local\Temp/ipykernel_23984/1592945625.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_1.mean()

col1      3.0
col2    532.8
dtype: float64

In [67]:
df_1.std()

C:\Users\AMIT\AppData\Local\Temp/ipykernel_23984/4017312627.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_1.std()

col1     1.581139
col2    92.869263
dtype: float64

In [70]:
df_1

   col1  col2 col3
0     1   444  abc
1     2   555  dff
2     3   666   rt
3     4   444   ii
4     5   555   fg

In [71]:
df_1.sort_values(by='col3')

   col1  col2 col3
0     1   444  abc
1     2   555  dff
4     5   555   fg
3     4   444   ii
2     3   666   rt

In [ ]:
df ={"col":[1,2,3],
     "col2":[4,5,6]}

In [19]:
df

{'col': [1, 2, 3], 'col2': [4, 5, 6]}